---
kind: property
id: P:Autodesk.Revit.DB.Visual.AssetPropertyInteger.Value
source: html/bc4e5f90-c2b1-7ec6-93bb-74e965e7dd50.htm
---
# Autodesk.Revit.DB.Visual.AssetPropertyInteger.Value Property

The value of the property.

## Syntax (C#)
```csharp
public int Value { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The input value is invalid for this AssetPropertyInteger property.
- **Autodesk.Revit.Exceptions.InvalidOperationException** - When setting this property: The asset property is not editable.